# ax^2 + bx + c = 0
# a = int(input("a = "))
# b = int(input("b = "))
# c = int(input("c = "))
#
# d = b**2 - 4*a*c
#
# if d > 0:
#     x1 = (-b + d**0.5) / (2*a)
#     x2 = (-b - d**0.5) / (2*a)
#     print("Два корені:", x1, x2)
# elif d == 0:
#     x = -b / (2*a)
#     print("Один корінь:", x)
# else:
#     print("Немає дійсних коренів")


# Дано целое число. Вывести его строку-описание вида «отрицательное чет-
# ное число», «нулевое число», «положительное нечетное число» и т. д.

# a = int(input("Введи число: "))
# if a == 0:
#     print("нулевое", end=' ')
# else:
#     if a > 0:
#         print("положительное" , end=' ')
#     else:
#         print("отрицательное", end=' ')
#
#     if a % 2 == 0:
#         print("чётное", end=' ')
#     else:
#         print("нечётное", end=' ')
# print("число")


# Дано целое число, лежащее в диапазоне 1–999. Вывести его строку-
# описание вида «четное двузначное число», «нечетное трехзначное число»
# и т. д.

# a = int(input("Введи число в диапозоне 1-999: "))
# if a % 2 == 0:
#     print("четнок ", end='')
# else:
#     print("нечетное ", end='')
# if a < 10:
#     print("однозначное число ")
# elif a < 100:
#     print("двухзначное число ")
# else:
#     print("трехзначное число ")


# Дано целое число в диапазоне 1–99, определяющее возраст (в годах).
# Вывести строку-описание указанного возраста, обеспечив правильное со-
# гласование числа со словом «год», например: 20 — «двадцать лет», 32 —
# «тридцать два года», 41 — «сорок один год».

# a = int(input("a= "))
# b = a//10
# c = a%10
# if b==2:
#     print("двадцять", end=' ')
# elif b==3:
#     print("тридцять", end=' ')
# elif b==4:
#     print("чорок", end=' ')
# elif b==5:
#     print("п'ятдесят", end=' ')
# else:
#     print("шістдесят", end=' ')
#
# if c==1:
#     print("один", end=' ')
# elif b==2:
#     print("два", end=' ')
# elif b==3:
#     print("три", end=' ')
# elif b==4:
#     print("чотири", end=' ')
# elif b==5:
#     print("п'ять", end=' ')
# elif b==6:
#     print("шість", end=' ')
# elif b == 7:
#     print("сім", end=' ')
# elif b == 8:
#     print("вісім", end=' ')
# else:
#     print("дев'ять", end=' ')
#
# if c == 1:
#     print("рік")
# elif c>=2 and c<=4:
#     print("роки")
# else:
#     print("років")


# a = int(input("a = "))
# if 10 <= a <= 19:
#     if a == 10:
#         print("десять років")
#     elif a == 11:
#         print("одинадцять років")
#     elif a == 12:
#         print("дванадцять років")
#     elif a == 13:
#         print("тринадцять років")
#     elif a == 14:
#         print("чотирнадцять років")
#     elif a == 15:
#         print("пʼятнадцять років")
#     elif a == 16:
#         print("шістнадцять років")
#     elif a == 17:
#         print("сімнадцять років")
#     elif a == 18:
#         print("вісімнадцять років")
#     elif a == 19:
#         print("девʼятнадцять років")
# else:
#     if a >= 90:
#         print("девʼяносто", end=" ")
#     elif a >= 80:
#         print("вісімдесят", end=" ")
#     elif a >= 70:
#         print("сімдесят", end=" ")
#     elif a >= 60:
#         print("шістдесят", end=" ")
#     elif a >= 50:
#         print("пʼятдесят", end=" ")
#     elif a >= 40:
#         print("сорок", end=" ")
#     elif a >= 30:
#         print("тридцять", end=" ")
#     elif a >= 20:
#         print("двадцять", end=" ")
#
#     if a%10 == 1:
#         print("один рік")
#     elif a%10 == 2:
#         print("два роки")
#     elif a%10 == 3:
#         print("три роки")
#     elif a%10 == 4:
#         print("чотири роки")
#     elif a%10 == 5:
#         print("пʼять років")
#     elif a%10 == 6:
#         print("шість років")
#     elif a%10 == 7:
#         print("сім років")
#     elif a%10 == 8:
#         print("вісім років")
#     elif a%10 == 9:
#         print("девʼять років")
#     elif a%10 == 0:
#         print("років")


M = int(input("Сколько всего молока (л): "))
R = int(input("Сколько процентов выпил первый котик: "))
L = int(input("Сколько мл выпил второй котик: "))
k1 = M * R / 100
k2 = L
k3 = M - k1 - k2
if k1 > k2 and k1 > k3:
    print("Первый котик выпил больше всех")
elif k2 > k1 and k2 > k3:
    print("Второй котик выпил больше всех")
elif k3 > k1 and k3 > k2:
    print("Третий котик выпил больше всех")
else:
    print("Есть котики, которые выпили одинаково много")