# a = int(input("a = "))
# if a > 0:
#     print("Positive")
# elif a < 0:
#     print("Negative")
# else:
#     print("Null")


# a = int(input("a = "))
# if a % 2 == 0:
#     a *= 2
#
# print(a)


# Дано целое число. Если оно является положительным, то прибавить к не-
# му 1; в противном случае вычесть из него 2. Вывести полученное число.


# a = int(input(" : "))
# if a > 0:
#     a += 1
# else:
#     a -= 2
# print(a)


# Даны чотири целых числа. Найти количество положительных чисел в исход-
# ном наборе.

# a = int(input("a = "))
# b = int(input("b = "))
# c = int(input("c = "))
# d = int(input("d = "))
# s = 0
# if a > 0:
#     s += 1
# if b > 0:
#     s += 1


# Даны два числа. Вывести вначале большее, а затем меньшее из них.

# a = int(input("a = "))
# b = int(input("b = "))
# if a > b:
#     print(a, b)
# else:
#     print(b, a)

# Даны две переменные целого типа: A и B. Если их значения не равны, то
# присвоить каждой переменной сумму этих значений, а если равны, то при-
# своить переменным нулевые значения. Вывести новые значения перемен-
# ных A и B.

# a = b = a + b
# a = b = 0


# Даны три числа. Найти наименьшее из них.
# if a < b and a < c:
#     print(a)
# elif b < c:
#     print(b)
# else:
#     print(c)

# Даны три числа. Найти среднее из них (то есть число, расположенное ме-
# жду наименьшим и наибольшим).


# Даны три числа. Найти сумму двух наибольших из них.


# Даны три переменные цілого типа: A, B, C. Если их значения упо-
# рядочены по возрастанию, то удвоить их; в противном случае заменить
# значение каждой переменной на противоположное. Вывести новые значе-
# ния переменных A, B, C.


# Даны цілі положительные числа a, b, c. Если
# существует треугольник со сторонами a, b, c, то определить, яв-
# ляется ли он прямоугольным.


# Даны два различных целых числа a и b (a ≠ 0, b ≠ 0).
# Определить, является ли a делителем b, или b является ли дели-
# телем a, или ни одно из чисел не является делителем другого.