
# ! not
# > < == != >= <=
# a = 5
# b = 4
# c = not a
# print(c)
# print(5 <= 5)

# or +, and *
# print(True and True)
# print(False and True)
# print(True and False)
# print(False and False)

# a = int(input("a = "))
# res = a > 0
# print(res)

# Дано целое число A. Проверить истинность высказывания: «Число A
# является нечетным».
# a = int(input("a = "))
# res = a % 2 == 1
# print(res)

# Даны два целых числа: A, B. Проверить истинность высказывания:
# «Справедливы неравенства A > 2 и B ≤ 3».

# a = int(input("a = "))
# b = int(input("b = "))
# res = a > 2 and b <= 3
# print(res)


# Даны три целых числа: A, B, C. Проверить истинность высказыва-
# ния: «Справедливо двойное неравенство A < B < C».


# Даны три целых числа: A, B, C. Проверить истинность высказыва-
# ния: «Число B находится между числами A и C».

# a < b < c or c < b < a


# Даны два целых числа: A, B. Проверить истинность высказывания:
# «Каждое из чисел A и B нечетное».


# Даны два целых числа: A, B. Проверить истинность высказывания:
# «Ровно одно из чисел A и B нечетное».

# a % 2 == 1 and b % 2 == 0 or a % 2 == 0 and b % 2 == 1

# Даны два целых числа: A, B. Проверить истинность высказывания:
# «Числа A и B имеют одинаковую четность».

# a % 2 != b % 2


# Даны три целых числа: A, B, C. Проверить истинность высказыва-
# ния: «Хотя бы одно из чисел A, B, C положительное».
# a > 0 or b > 0 or c > 0


# Даны три целых числа: A, B, C. Проверить истинность высказыва-
# ния: «Ровно одно из чисел A, B, C положительное».

# res =(a > 0) + (b > 0) + (c > 0) == 1


# Дано целое положительное число. Проверить истинность высказы-
# вания: «Данное число является четным двузначным».
